---
kind: method
id: M:Autodesk.Revit.DB.Document.CanEnableCloudWorksharing
zh: 文档、文件
source: html/efceae4b-4d93-9097-cf8a-a223aa9412fb.htm
---
# Autodesk.Revit.DB.Document.CanEnableCloudWorksharing Method

**中文**: 文档、文件

Checks if cloud worksharing can be enabled for the cloud model.

## Syntax (C#)
```csharp
public bool CanEnableCloudWorksharing()
```

## Returns
True if cloud worksharing can be enabled in the document, which also means the current document is a single user cloud model, False otherwise.